<b>Aim:- Our task is to fetch List of Nobel laureates in Literature from Wikipedia and Store it in Tabular Format as well as in CSV Format Using Python.</b>

> <b>NOTE:-</b> This Module is dedicated for the Learning Purpose Only. <br/>

All the Necessary libraries used in this Module has been stated below:-

```
Library Requirments:-
1. pandas (to install type:- 'pip install pandas')
```

<b>Information and Usage of Library:-</b>

<b>1. pandas:- </b>
"pandas" is a Python package that provides fast, flexible, and expressive data structures designed to make working with structured (tabular, multidimensional, potentially heterogeneous) and time series data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, "real world data analysis in Python". Additionally, it has the broader goal of becoming "the most powerful and flexible open source data analysis / manipulation tool available in any language". It is already well on its way toward this goal. 

pandas is well suited for many different kinds of data. The <b>two primary data structures of pandas</b> stated below:-

<b>a. Series (1-Dimensional)</b>

<b>b. DataFrame (2-Dimensional)</b>

<br/>

<b>2. pandas.io.html:- </b>
"pandas.io.html" is a sub part of module "pandas.io" and this is already available in "pandas". "pandas.io" is a set of Pandas I/O API. For the top level of `reader` functions accessed like `pandas.read_csv()` that generally returns pandas object. The Corresponding `writer` functions are object methods that are accessed like `DataFrame.to_csv()`.

But in our Case we have Used `pandas.io.html` module. Which Provide us "Text Format Type" from the `reader` function `read.html` and leads to `writer` function `to_html`. In simple words we can Conclude that "pandas.io.html" Module has been used for Read HTML tables into a `list` of `DataFrame` Objects.

In [1]:
# Importing all the Important Libraries
import pandas as pd
from pandas.io.html import read_html

<h2>Fetch Table Content from URL in Tabular Format</h2>

In [2]:
# Extract Website Content and Store it into Website URL Variable
website_url = 'https://en.wikipedia.org/wiki/List_of_Nobel_laureates_in_Literature'

# Read HTML Data and Fetch Tabular Data
wiki_tables = read_html(website_url,  attrs = {"class":"wikitable sortable"}, header = None)

# Print Number of Tables Extracted
print ("\nExtracted {num} WikiTables".format(num = len(wiki_tables)), "\n")

Extracted 4 WikiTables

In [3]:
# Remove Unnecessary Data From Table 1 (in our case Remove 'Picture': 'NaN') and Fetch All Noble Prize Winner Information 
wiki_tables[0].drop("Picture", axis = 1).head(10)

,Year,Laureate,Country,Language(s),Citation,Genre(s)
0,1901,Sully Prudhomme (1839 – 1907),France,French,"""in special recognition of his poetic composit...","poetry, essay"
1,1902,Theodor Mommsen (1817 – 1903),Germany,German,"""the greatest living master of the art of hist...","history, law"
2,1903,Bjørnstjerne Bjørnson (1832 – 1910),Norway,Norwegian,"""as a tribute to his noble, magnificent and ve...","poetry, novel, drama"
3,1904,Frédéric Mistral (1830 – 1914),France,Provençal,"""in recognition of the fresh originality and t...","poetry, philology"
4,1904,José Echegaray (1830 – 1914),Spain,Spanish,"""in recognition of the numerous and brilliant ...",drama
5,1905,Henryk Sienkiewicz (1846 – 1916),Poland( Russian Empire),Polish,"""because of his outstanding merits as an epic ...",novel
6,1906,Giosuè Carducci (1835 – 1907),Italy,Italian,"""not only in consideration of his deep learnin...",poetry
7,1907,Rudyard Kipling (1865 – 1936),United Kingdom,English,"""in consideration of the power of observation,...","novel, short story, poetry"
8,1908,Rudolf Christoph Eucken (1846 – 1926),Germany,German,"""in recognition of his earnest search for trut...",philosophy
9,1909,Selma Lagerlöf (1858 – 1940),Sweden,Swedish,"""in appreciation of the lofty idealism, vivid ...","novel, short story"

In [4]:
# Print Table 2 From List Which Will Fetch Number of Noble Prize Won By Each Country 
wiki_tables[1].head(10)

          Country  Number
0          France      17
1   United States      13
2  United Kingdom      11
3         Germany      10
4          Sweden       8
5          Poland       6
6           Spain       6
7           Italy       6
8         Ireland       4
9     Russia/USSR       4

In [5]:
# Print Table 3 From List Which Will Fetch Number of Noble Prize Won By Which Language Proefficiency 
wiki_tables[2].head(10)

    Language    Number
0    English  29 (32)1
1     French        14
2     German  14 (15)2
3    Spanish        11
4    Swedish         7
5    Italian         6
6    Russian         6
7     Polish         5
8     Danish         3
9  Norwegian         3

In [6]:
# Print Table 4 From List Which Will Fetch Number of Noble Prize Won By Which Decade and Which Gender
wiki_tables[3].head(10)

      Decade  Male  Female
0  1900–1909     9       1
1  1910–1919     9       0
2  1920–1929     8       2
3  1930–1939     8       1
4  1940–1949     5       1
5  1950–1959    10       0
6  1960–1969    10       1
7  1970–1979    11       0
8  1980–1989    10       0
9  1990–1999     7       3

<h2>Store Multiple Fetched Tables in CSV Format and Use basic operation on it...</h2>

In [7]:
# HTML Table to CSV Format Conversion For Whole Noble Prize Winner Data
wiki_data_file_1 = 'wiki_data_table.csv'
wiki_tables[0].to_csv(wiki_data_file_1, sep = ',')

In [8]:
# HTML Table to CSV Format Conversion For Whole Noble Prize Won By Each Country
wiki_data_file_2 = 'wiki_data_country.csv'
wiki_tables[1].to_csv(wiki_data_file_2, sep = ',')

In [9]:
# HTML Table to CSV Format Conversion For Whole Noble Prize Won By Language Proefficiency
wiki_data_file_3 = 'wiki_data_language.csv'
wiki_tables[2].to_csv(wiki_data_file_3, sep = ',')

In [10]:
# HTML Table to CSV Format Conversion For Whole Noble Prize Won By Which Decade and Which Gemder
wiki_data_file_4 = 'wiki_data_decade_and_gender.csv'
wiki_tables[3].to_csv(wiki_data_file_4, sep = ',')

In [11]:
# Read CSV Data From Data Table for Further Analysis
wiki_data = pd.read_csv("E:/GitHub Repositories/Data Warehouse and Mining/Web Scraping Using Python/Wikipedia Table/wiki_data_table.csv")
country_data = pd.read_csv("E:/GitHub Repositories/Data Warehouse and Mining/Web Scraping Using Python/Wikipedia Table/wiki_data_country.csv")
language_data = pd.read_csv("E:/GitHub Repositories/Data Warehouse and Mining/Web Scraping Using Python/Wikipedia Table/wiki_data_language.csv")
decade_and_gender_data = pd.read_csv("E:/GitHub Repositories/Data Warehouse and Mining/Web Scraping Using Python/Wikipedia Table/wiki_data_decade_and_gender.csv")

In [12]:
# Fetch Clean Data from the Whole Noble Prize Winner Wikipedia Data 
wiki_data = wiki_data.drop(columns=["Unnamed: 0", "Picture"], axis = 1)
wiki_data.head(10)

,Year,Laureate,Country,Language(s),Citation,Genre(s)
0,1901,Sully Prudhomme (1839 – 1907),France,French,"""in special recognition of his poetic composit...","poetry, essay"
1,1902,Theodor Mommsen (1817 – 1903),Germany,German,"""the greatest living master of the art of hist...","history, law"
2,1903,Bjørnstjerne Bjørnson (1832 – 1910),Norway,Norwegian,"""as a tribute to his noble, magnificent and ve...","poetry, novel, drama"
3,1904,Frédéric Mistral (1830 – 1914),France,Provençal,"""in recognition of the fresh originality and t...","poetry, philology"
4,1904,José Echegaray (1830 – 1914),Spain,Spanish,"""in recognition of the numerous and brilliant ...",drama
5,1905,Henryk Sienkiewicz (1846 – 1916),Poland( Russian Empire),Polish,"""because of his outstanding merits as an epic ...",novel
6,1906,Giosuè Carducci (1835 – 1907),Italy,Italian,"""not only in consideration of his deep learnin...",poetry
7,1907,Rudyard Kipling (1865 – 1936),United Kingdom,English,"""in consideration of the power of observation,...","novel, short story, poetry"
8,1908,Rudolf Christoph Eucken (1846 – 1926),Germany,German,"""in recognition of his earnest search for trut...",philosophy
9,1909,Selma Lagerlöf (1858 – 1940),Sweden,Swedish,"""in appreciation of the lofty idealism, vivid ...","novel, short story"

In [13]:
# Print Data Count of Whole Noble Prize Winner Wikipedia Data
wiki_data.count()

Year           124
Laureate       124
Country        124
Language(s)    124
Citation       124
Genre(s)       124
dtype: int64

In [14]:
# Print Information of Whole Noble Prize Winner Wikipedia Data
wiki_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124 entries, 0 to 123
Data columns (total 6 columns):
Year           124 non-null int64
Laureate       124 non-null object
Country        124 non-null object
Language(s)    124 non-null object
Citation       124 non-null object
Genre(s)       124 non-null object
dtypes: int64(1), object(5)
memory usage: 3.5+ KB

In [15]:
# Describe Whole Noble Prize Winner Wikipedia Data
wiki_data.describe()

              Year
count   124.000000
mean   1959.846774
std      34.832245
min    1901.000000
25%    1929.750000
50%    1960.500000
75%    1989.250000
max    2020.000000

In [16]:
# Fetch Clean Data from the Country Dataset of Noble Prize Winner on Wikipedia
country_data = country_data.drop(columns="Unnamed: 0", axis = 1)
country_data.head(10)

          Country  Number
0          France      17
1   United States      13
2  United Kingdom      11
3         Germany      10
4          Sweden       8
5          Poland       6
6           Spain       6
7           Italy       6
8         Ireland       4
9     Russia/USSR       4

In [17]:
# Print Data Count of Country Dataset of Noble Prize Winner on Wikipedia
country_data.count()

Country    41
Number     41
dtype: int64

In [18]:
# Print Information of the Country Dataset of Noble Prize Winner on Wikipedia
country_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 2 columns):
Country    41 non-null object
Number     41 non-null int64
dtypes: int64(1), object(1)
memory usage: 556.0+ bytes

In [19]:
# Describe the Country Dataset of Noble Prize Winner on Wikipedia
country_data.describe()

          Number
count  41.000000
mean    3.073171
std     3.744264
min     1.000000
25%     1.000000
50%     1.000000
75%     3.000000
max    17.000000

In [20]:
# Fetch Clean Data from the Language Dataset of Noble Prize Winner on Wikipedia
language_data = language_data.drop(columns="Unnamed: 0", axis = 1)
language_data.head(10)

    Language    Number
0    English  29 (32)1
1     French        14
2     German  14 (15)2
3    Spanish        11
4    Swedish         7
5    Italian         6
6    Russian         6
7     Polish         5
8     Danish         3
9  Norwegian         3

In [21]:
# Print Data Count of Language Dataset of Noble Prize Winner on Wikipedia
language_data.count()

Language    25
Number      25
dtype: int64

In [22]:
# Print Information of the Language Dataset of Noble Prize Winner on Wikipedia
language_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
Language    25 non-null object
Number      25 non-null object
dtypes: object(2)
memory usage: 264.0+ bytes

In [23]:
# Describe the Language Dataset of Noble Prize Winner on Wikipedia
language_data.describe()

       Language Number
count        25     25
unique       25     10
top      Polish      1
freq          1     12

In [24]:
# Fetch Clean Data from the Decade and Gender Dataset of Noble Prize Winner on Wikipedia
decade_and_gender_data = decade_and_gender_data.drop(columns="Unnamed: 0", axis = 1)
decade_and_gender_data.head(10)

      Decade  Male  Female
0  1900–1909     9       1
1  1910–1919     9       0
2  1920–1929     8       2
3  1930–1939     8       1
4  1940–1949     5       1
5  1950–1959    10       0
6  1960–1969    10       1
7  1970–1979    11       0
8  1980–1989    10       0
9  1990–1999     7       3

In [25]:
# Print Data Count of Decade and Gender Dataset of Noble Prize Winner on Wikipedia
decade_and_gender_data.count()

Decade    14
Male      14
Female    14
dtype: int64

In [26]:
# Print Information of Decade and Gender Dataset of Noble Prize Winner on Wikipedia
decade_and_gender_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
Decade    14 non-null object
Male      14 non-null int64
Female    14 non-null int64
dtypes: int64(2), object(1)
memory usage: 344.0+ bytes

In [27]:
# Describe the Decade and Gender Dataset of Noble Prize Winner on Wikipedia
decade_and_gender_data.describe()

             Male     Female
count   14.000000  14.000000
mean    14.428571   2.285714
std     25.068258   4.103068
min      0.000000   0.000000
25%      7.000000   0.250000
50%      8.500000   1.000000
75%     10.000000   2.750000
max    101.000000  16.000000